## Introduction to Data Frame

In [3]:
# Importing pandas
import pandas as pd

In [4]:
# Creating data frame sample syntax

df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]], columns=["A", "B", "C", "D"], index=[1, 2, 3])

# Using columns=[] for editing column names
# using index=[] for editing row names

In [5]:
# To show Data Frame
df

   A   B   C   D
1  1   2   3   4
2  5   6   7   8
3  9  10  11  12

In [6]:
# Show from top rows
df.head(1)

   A  B  C  D
1  1  2  3  4

In [7]:
# Show from button rows
df.tail(1)

   A   B   C   D
3  9  10  11  12

In [8]:
# Show index
df.index.tolist()

[1, 2, 3]

In [9]:
# Show info of Data Frame
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
 3   D       3 non-null      int64
dtypes: int64(4)
memory usage: 120.0 bytes

In [10]:
df.describe()

         A     B     C     D
count  3.0   3.0   3.0   3.0
mean   5.0   6.0   7.0   8.0
std    4.0   4.0   4.0   4.0
min    1.0   2.0   3.0   4.0
25%    3.0   4.0   5.0   6.0
50%    5.0   6.0   7.0   8.0
75%    7.0   8.0   9.0  10.0
max    9.0  10.0  11.0  12.0

In [11]:
# Shows the unique values
df.nunique()

A    3
B    3
C    3
D    3
dtype: int64

In [12]:
# Show the Data Frame Array
df['A'].unique()

array([1, 5, 9])

In [13]:
# Shows the shape of Data Frame
df.shape

# (row, column)

(3, 4)

In [ ]:
# Show the size of Data Frame
df.size

12